[
    {
        "title": "What does HTML stand for?",
        "answer": "HTML stands for HyperText Markup Language.\n\nTo break this down:\n\n* HyperText refers to text that contains links to other texts, allowing users to easily navigate between connected documents.\n\n* Markup indicates that HTML is used to annotate text with codes that define how the text should be structured and presented.\n\n* Language signifies that HTML has its own syntax and rules for writing these markup instructions.\n\nHTML is the standard markup language for creating web pages. It describes the structure and content of a web page, which web browsers then interpret to display the page to users."
    },
    {
        "title": "What is the purpose of the <!DOCTYPE html> declaration?",
        "answer": "The purpose of the <!DOCTYPE html> declaration is:\n\n* To specify that the document is an HTML5 document\n\n* To help browsers render the page correctly by indicating which version of HTML the page is using\n\n* To ensure consistent rendering across different browsers\n\n* To enable proper validation of the HTML document\n\n* To trigger standards mode in browsers, rather than quirks mode\n\nThis declaration should be the very first line in an HTML document, before the <html> tag."
    },
    {
        "title": "What are HTML tags?",
        "answer": "They are the building blocks of HTML, used to create elements"
    },
    {
        "title": "What is an HTML element?",
        "answer": "An element is a part of an HTML document defined by a start tag, content, and an end tag"
    },
    {
        "title": "What is an HTML attribute?",
        "answer": "Attributes provide additional information about HTML elements"
    },
    {
        "title": "What is the difference between <div> and <span>?",
        "answer": "<div> is a block-level element, while <span> is an inline element"
    },
    {
        "title": "What is the purpose of the <head> tag?",
        "answer": "The <head> tag contains meta-information about the document, such as title, links to stylesheets, and meta tags"
    },
    {
        "title": "What is the purpose of the <body> tag?",
        "answer": "The <body> tag contains the content of the HTML document"
    },
    {
        "title": "What is a semantic element in HTML?",
        "answer": "A semantic element clearly describes its meaning in a human- and machine-readable way, like <article>, <footer>, and <section>"
    },
    {
        "title": "What is the difference between <strong> and <b>?",
        "answer": "<strong> indicates that the enclosed text is of strong importance, while <b> simply makes the text bold without implying importance"
    },
    {
        "title": "What is the difference between <em> and <i>?",
        "answer": "<em> indicates emphasized text with stress, while <i> just italicizes the text"
    },
    {
        "title": "What is the <a> tag used for?",
        "answer": "The <a> tag is used to create hyperlinks"
    },
    {
        "title": "What is the purpose of the <img> tag?",
        "answer": "The <img> tag is used to embed images in an HTML document"
    },
    {
        "title": "What does the alt attribute in the <img> tag specify?",
        "answer": "The alt attribute provides alternative text for an image if it cannot be displayed"
    },
    {
        "title": "What is the purpose of the <ul> and <ol> tags?",
        "answer": "<ul> is used for unordered lists, and <ol> is used for ordered lists"
    },
    {
        "title": "What is the <table> tag used for?",
        "answer": "The <table> tag is used to create tables in HTML"
    },
    {
        "title": "What is the purpose of the <form> tag?",
        "answer": "The <form> tag is used to create a form for user input"
    },
    {
        "title": "What are the common attributes of the <form> tag?",
        "answer": "Common attributes include action, method, and enctype"
    },
    {
        "title": "What is the purpose of the <input> tag?",
        "answer": "The <input> tag is used to create input fields in a form"
    },
    {
        "title": "What are the different types of <input> fields?",
        "answer": "Common types include text, password, submit, reset, radio, checkbox, button, file, hidden, image, date, and email"
    },
    {
        "title": "What is the purpose of the <textarea> tag?",
        "answer": "The <textarea> tag is used to create a multi-line text input field"
    },
    {
        "title": "What is the purpose of the <button> tag?",
        "answer": "The <button> tag is used to create clickable buttons"
    },
    {
        "title": "What is the <select> tag used for?",
        "answer": "The <select> tag is used to create a drop-down list"
    },
    {
        "title": "What is the <option> tag used for?",
        "answer": "The <option> tag defines an option in a drop-down list"
    },
    {
        "title": "What is the <link> tag used for?",
        "answer": "The <link> tag is used to link external resources like stylesheets"
    },
    {
        "title": "What is the <meta> tag used for?",
        "answer": "The <meta> tag provides metadata about the HTML document, such as author, description, and keywords"
    },
    {
        "title": "What is the <title> tag used for?",
        "answer": "The <title> tag sets the title of the HTML document, shown in the browser's title bar or tab"
    },
    {
        "title": "What is the <style> tag used for?",
        "answer": "The <style> tag is used to define internal CSS"
    },
    {
        "title": "What is the <script> tag used for?",
        "answer": "The <script> tag is used to embed or reference JavaScript code"
    },
    {
        "title": "What is the purpose of the <header> tag?",
        "answer": "The <header> tag represents the header of a section or page, typically containing headings, logos, and navigation"
    },
    {
        "title": "What is the purpose of the <footer> tag?",
        "answer": "The <footer> tag represents the footer of a section or page, typically containing author information, copyright, and links"
    },
    {
        "title": "What is the <main> tag used for?",
        "answer": "The <main> tag specifies the main content of a document"
    },
    {
        "title": "What is the <section> tag used for?",
        "answer": "The <section> tag defines sections in a document, such as chapters, headers, footers, or any other sections"
    },
    {
        "title": "What is the <article> tag used for?",
        "answer": "The <article> tag represents a self-contained composition in a document, like a blog post or news article"
    },
    {
        "title": "What is the <aside> tag used for?",
        "answer": "The <aside> tag represents content that is tangentially related to the content around it, like sidebars or call-out boxes"
    },
    {
        "title": "What is the <nav> tag used for?",
        "answer": "The <nav> tag defines a set of navigation links"
    },
    {
        "title": "What is the <figure> tag used for?",
        "answer": "The <figure> tag specifies self-contained content, like illustrations, diagrams, or photos"
    },
    {
        "title": "What is the <figcaption> tag used for?",
        "answer": "The <figcaption> tag defines a caption for a <figure> element"
    },
    {
        "title": "What is the <time> tag used for?",
        "answer": "The <time> tag represents a specific period in time"
    },
    {
        "title": "What is the purpose of the <mark> tag?",
        "answer": "The <mark> tag highlights or marks text for reference or notation"
    },
    {
        "title": "What is the <progress> tag used for?",
        "answer": "The <progress> tag represents the completion progress of a task"
    },
    {
        "title": "What is the <meter> tag used for?",
        "answer": "The <meter> tag represents a scalar measurement within a known range, like disk usage or temperature"
    },
    {
        "title": "What is the <details> tag used for?",
        "answer": "The <details> tag specifies additional details that the user can view or hide"
    },
    {
        "title": "What is the <summary> tag used for?",
        "answer": "The <summary> tag defines a visible heading for a <details> element"
    },
    {
        "title": "What is the purpose of the <template> tag?",
        "answer": "The <template> tag holds client-side content that should not be displayed when the page loads but can be displayed later using JavaScript"
    },
    {
        "title": "What is the <blockquote> tag used for?",
        "answer": "The <blockquote> tag is used to define a section that is quoted from another source"
    },
    {
        "title": "What is the <code> tag used for?",
        "answer": "The <code> tag defines a piece of computer code"
    },
    {
        "title": "What is the <pre> tag used for?",
        "answer": "The <pre> tag defines preformatted text, preserving whitespace and line breaks"
    },
    {
        "title": "What is the <abbr> tag used for?",
        "answer": "The <abbr> tag defines an abbreviation or acronym"
    }
]